/*
Задать температуру в градусах по Цельсию. Вывести в alert
соответствующую температуру в градусах по Фаренгейту.
Подсказка: расчет идет по формуле Tf = (9 / 5) * Tc + 32, где Tf —
температура по Фаренгейту, Tc — по Цельсию.
*/
const tc = 15
alert(`${tc} градусов Цельсия = ${(9 / 5) * tc + 32} градусам Фаренгейта`)

/*
Объявить две переменные: admin и name. Записать в name
строку "Василий"; Скопировать значение из name в admin.
Вывести admin (должно вывестись «Василий»).
*/
let admin, name
name = 'Василий'
admin = name
alert(admin)

/*
Чему будет равно JS-выражение 1000 + "108"?
*/
alert(1000 + "108") // 1000108 <- конкатинация числа со строкой

