# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

def vvodInt(msg):
    return int(input(msg))

def proverka(x):
    match x:
        case 1:
            print('x: от 0 до +бессконечности')
            print('y: от 0 до +бессконечности')
        case 2:
            print('x: от 0 до -бессконечности')
            print('y: от 0 до +бессконечности')
        case 3:
            print('x: от 0 до -бессконечности')
            print('y: от 0 до -бессконечности')
        case _:
            print('x: от 0 до +бессконечности')
            print('y: от 0 до -бессконечности')

x = None
while x not in range(1,5):
    x = vvodInt('Введите номер четверти от 1 до 4: ')
    if x not in range(1,5):
        print('Вы ввели некорректное число')
proverka(x)